einavh550/pic32-embedded-mini-game/pic32_arcade_game.c
#include <xc.h>
#include <sys/attribs.h>
#include <stdlib.h>
#include <stdio.h>
#include <xc.h>

#pragma config JTAGEN = OFF
#pragma config FWDTEN = OFF
#pragma config FNOSC = FRCPLL
#pragma config FSOSCEN = OFF
#pragma config POSCMOD = EC
#pragma config OSCIOFNC = ON
#pragma config FPBDIV = DIV_1
#pragma config FPLLIDIV = DIV_2
#pragma config FPLLMUL = MUL_20
#pragma config FPLLODIV = DIV_1

#define LCD_CLEAR 0x01
#define LCD_LINE1 0x80
#define LCD_LINE2 0xC0

// RGB LED effect variables
volatile int green_blink_active = 0;
volatile int red_blink_active = 0;
volatile int red_blink_count = 0;

// Seven-segment display variables
volatile int ssd_digit = 0;
volatile int coin_display_value = 0;
unsigned char ssd_segments[16] = {
    0x3F, // 0
    0x06, // 1
    0x5B, // 2
    0x4F, // 3
    0x66, // 4
    0x6D, // 5
    0x7D, // 6
    0x07, // 7
    0x7F, // 8
    0x6F, // 9

};

void lcd_cmd(unsigned char cmd);
void lcd_data(unsigned char data);
void init_lcd(void);
void lcd_write_str(const char *str);
void delay_ms(int ms);
void busy(void);
void ADC_Init(void);
unsigned int ADC_AnalogRead(unsigned char analogPIN);
void setup_pins();
int scan_keypad();
void load_custom_char_hands_down(void);
void load_custom_char_hands_up(void);
void load_custom_char_dog(void);
void load_custom_char_coin(void);
void load_custom_char_bomb(void);
void buzz_soft_beep(void);
void delay_us(unsigned int us);
void init_RGB_LED();
void init_timer5(void);
void trigger_green_blink(void);
void trigger_red_blink(void);
void init_ssd(void);
void display_coins(int coin_count);

// Timer5 ISR for RGB LED effects and Seven-segment display
void __ISR(_TIMER_5_VECTOR, ipl4auto) Timer5ISR(void)
{
    static int green_timer_count = 0;
    static int red_timer_count = 0;
    static int led_timer_count = 0;
    
    // LED effects (run at slower rate)
    led_timer_count++;
    if (led_timer_count >= 100) {  // Every 200ms for LED effects
        if (green_blink_active) {
            green_timer_count++;
            if (green_timer_count >= 3) {  // 3 x 200ms = 600ms (about half second)
                LATDbits.LATD12 = 0;       // Turn off green (RD12)
                green_blink_active = 0;
                green_timer_count = 0;
            }
        }
        
        if (red_blink_active) {
            red_timer_count++;
            if (red_timer_count >= 1) {    // 200ms intervals for fast but visible blinks
                LATDbits.LATD2 ^= 1;       // Toggle red (RD2)
                red_blink_count++;
                red_timer_count = 0;
                
                if (red_blink_count >= 6) {  // 3 complete blinks (6 toggles)
                    LATDbits.LATD2 = 0;      // Turn off red (RD2)
                    red_blink_active = 0;
                    red_blink_count = 0;
                }
            }
        }
        led_timer_count = 0;
    }
    
    // Seven-segment display multiplexing (every 2ms for smooth display)
    // Turn off all digits first
    LATBbits.LATB12 = 1;  // AN0
    LATBbits.LATB13 = 1;  // AN1
    LATAbits.LATA9 = 1;   // AN2
    LATAbits.LATA10 = 1;  // AN3
    
    // Extract digits from coin_display_value
    int thousands = (coin_display_value / 1000) % 10;
    int hundreds = (coin_display_value / 100) % 10;
    int tens = (coin_display_value / 10) % 10;
    int ones = coin_display_value % 10;
    
    // Display current digit
    switch(ssd_digit) {
        case 0:  // Display thousands (leftmost digit)
            // Set cathode segments for thousands digit
            LATGbits.LATG12 = !(ssd_segments[thousands] & 0x01);  // CA
            LATAbits.LATA14 = !(ssd_segments[thousands] & 0x02);  // CB
            LATDbits.LATD6 = !(ssd_segments[thousands] & 0x04);   // CC
            LATGbits.LATG13 = !(ssd_segments[thousands] & 0x08);  // CD
            LATGbits.LATG15 = !(ssd_segments[thousands] & 0x10);  // CE
            LATDbits.LATD7 = !(ssd_segments[thousands] & 0x20);   // CF
            LATDbits.LATD13 = !(ssd_segments[thousands] & 0x40);  // CG
            LATAbits.LATA10 = 0;  // Enable AN3 (leftmost)
            break;
        case 1:  // Display hundreds
            LATGbits.LATG12 = !(ssd_segments[hundreds] & 0x01);
            LATAbits.LATA14 = !(ssd_segments[hundreds] & 0x02);
            LATDbits.LATD6 = !(ssd_segments[hundreds] & 0x04);
            LATGbits.LATG13 = !(ssd_segments[hundreds] & 0x08);
            LATGbits.LATG15 = !(ssd_segments[hundreds] & 0x10);
            LATDbits.LATD7 = !(ssd_segments[hundreds] & 0x20);
            LATDbits.LATD13 = !(ssd_segments[hundreds] & 0x40);
            LATAbits.LATA9 = 0;   // Enable AN2
            break;
        case 2:  // Display tens
            LATGbits.LATG12 = !(ssd_segments[tens] & 0x01);
            LATAbits.LATA14 = !(ssd_segments[tens] & 0x02);
            LATDbits.LATD6 = !(ssd_segments[tens] & 0x04);
            LATGbits.LATG13 = !(ssd_segments[tens] & 0x08);
            LATGbits.LATG15 = !(ssd_segments[tens] & 0x10);
            LATDbits.LATD7 = !(ssd_segments[tens] & 0x20);
            LATDbits.LATD13 = !(ssd_segments[tens] & 0x40);
            LATBbits.LATB13 = 0;  // Enable AN1
            break;
        case 3:  // Display ones (rightmost digit)
            LATGbits.LATG12 = !(ssd_segments[ones] & 0x01);
            LATAbits.LATA14 = !(ssd_segments[ones] & 0x02);
            LATDbits.LATD6 = !(ssd_segments[ones] & 0x04);
            LATGbits.LATG13 = !(ssd_segments[ones] & 0x08);
            LATGbits.LATG15 = !(ssd_segments[ones] & 0x10);
            LATDbits.LATD7 = !(ssd_segments[ones] & 0x20);
            LATDbits.LATD13 = !(ssd_segments[ones] & 0x40);
            LATBbits.LATB12 = 0;  // Enable AN0 (rightmost)
            break;
    }
    
    ssd_digit = (ssd_digit + 1) % 4;
    
    IFS0bits.T5IF = 0;
}

void setup_pins() {
    // Configure keypad row pins as OUTPUTS
    TRISCbits.TRISC2 = 0; // x0 - RC2 is output
    TRISCbits.TRISC1 = 0; // x1 - RC1 is output
    TRISCbits.TRISC4 = 0; // x2 - RC4 is output
    TRISGbits.TRISG6 = 0; // x3 - RG6 is output
    
