einavh550/pic32-embedded-mini-game/pic32_arcade_game.c
    // Initially set all rows HIGH
    LATCbits.LATC2 = 1;
    LATCbits.LATC1 = 1;
    LATCbits.LATC4 = 1;
    LATGbits.LATG6 = 1;

    // Configure keypad column pins as INPUTS with pull-ups
    TRISCbits.TRISC3 = 1;  // y0 - RC3 is input
    CNPUCbits.CNPUC3 = 1;  // Enable pull-up for RC3

    TRISGbits.TRISG7 = 1;  // y1 - RG7 is input
    CNPUGbits.CNPUG7 = 1;  // Enable pull-up for RG7

    TRISGbits.TRISG8 = 1;  // y2 - RG8 is input
    CNPUGbits.CNPUG8 = 1;  // Enable pull-up for RG8

    TRISGbits.TRISG9 = 1;  // y3 - RG9 is input
    CNPUGbits.CNPUG9 = 1;  // Enable pull-up for RG9

    
    ANSELGbits.ANSG6 = 0;  
    ANSELGbits.ANSG7 = 0;  
    ANSELGbits.ANSG8 = 0;  
    ANSELGbits.ANSG9 = 0;  
    
    TRISBbits.TRISB15 = 0; // RS
    TRISDbits.TRISD5 = 0;  // RW
    TRISDbits.TRISD4 = 0;  // EN
    TRISE = 0x00; // Data bus (all pins as output)
    ANSELE = 0x00;
    ANSELBbits.ANSB15 = 0;
    
    TRISBbits.TRISB14 = 0;
    ANSELBbits.ANSB14 = 0;

    
    
    ANSELEbits.ANSE2 = 0;
    ANSELEbits.ANSE4 = 0;
    ANSELEbits.ANSE5 = 0;
    ANSELEbits.ANSE6 = 0;
    
    TRISA &= 0XFF00;
    TRISFbits.TRISF3 = 1; // SW0 (RF3) for HEX counter mode
    TRISFbits.TRISF5 = 1; // SW1 (RF5) for SHIFT mode
    TRISFbits.TRISF4 = 1; // SW2 (RF4) for Fan mode
    TRISDbits.TRISD15 = 1; // SW3 (D15) for reverse mode
    
    

}

void init_RGB_LED(void)
{
    TRISDbits.TRISD2 = 0;   // Red LED
    TRISDbits.TRISD12 = 0;  // Green LED
    
    LATDbits.LATD2 = 0;     // Initially off
    LATDbits.LATD12 = 0;    // Initially off
}

void init_timer5(void)
{
    T5CONbits.ON = 0;
    T5CONbits.TGATE = 0;
    T5CONbits.TCS = 0;
    T5CONbits.TCKPS0 = 1;
    T5CONbits.TCKPS1 = 1;
    T5CONbits.TCKPS2 = 0;  // 1:16 prescaler for faster display refresh
    
    TMR5 = 0;
    PR5 = 1250;  // ~2ms intervals for smooth seven-segment display
    
    IPC5bits.T5IP = 4;
    IPC5bits.T5IS = 0;
    IFS0bits.T5IF = 0;
    IEC0bits.T5IE = 1;
    
    T5CONbits.ON = 1;
}

void trigger_green_blink(void)
{
    LATDbits.LATD12 = 1;     // Turn on green (RD12 is green)
    green_blink_active = 1;  // Will be turned off by timer
}

void trigger_red_blink(void)
{
    LATDbits.LATD2 = 1;      // Turn on red (RD2 is red)
    red_blink_active = 1;    // Will blink 3 times via timer
    red_blink_count = 0;
}

char scan_key[] = {
    0x44, '1',  0x34, '2',  0x24, '3',  0x14, 'A',
    0x43, '4',  0x33, '5',  0x23, '6',  0x13, 'B',
    0x42, '7',  0x32, '8',  0x22, '9',  0x12, 'C',
    0x41, '0',  0x31, 'F',  0x21, 'E',  0x11, 'D'
};


int scan_keypad() {
    int row, col;
    int flag = 0;

    // Row 1
    LATCbits.LATC2 = 0; // Activate row 1 (set LOW)
    delay_ms(1); // Short delay for signal to stabilize
    
    if (!PORTCbits.RC3) { col = 1; row = 1; flag = 1; }
    else if (!PORTGbits.RG7) { col = 2; row = 1; flag = 1; }
    else if (!PORTGbits.RG8) { col = 3; row = 1; flag = 1; }
    else if (!PORTGbits.RG9) { col = 4; row = 1; flag = 1; }
    
    LATCbits.LATC2 = 1; // Deactivate row (set HIGH)

    // Row 2
    if (!flag) {
        LATCbits.LATC1 = 0; // Activate row 2
        delay_ms(1);
        
        if (!PORTCbits.RC3) { col = 1; row = 2; flag = 1; }
        else if (!PORTGbits.RG7) { col = 2; row = 2; flag = 1; }
        else if (!PORTGbits.RG8) { col = 3; row = 2; flag = 1; }
        else if (!PORTGbits.RG9) { col = 4; row = 2; flag = 1; }
        
        LATCbits.LATC1 = 1; // Deactivate row
    }

    // Row 3
    if (!flag) {
        LATCbits.LATC4 = 0; // Activate row 3
        delay_ms(1);
        
        if (!PORTCbits.RC3) { col = 1; row = 3; flag = 1; }
        else if (!PORTGbits.RG7) { col = 2; row = 3; flag = 1; }
        else if (!PORTGbits.RG8) { col = 3; row = 3; flag = 1; }
        else if (!PORTGbits.RG9) { col = 4; row = 3; flag = 1; }
        
        LATCbits.LATC4 = 1; // Deactivate row
    }

    // Row 4
    if (!flag) {
        LATGbits.LATG6 = 0; // Activate row 4
        delay_ms(1);
        
        if (!PORTCbits.RC3) { col = 1; row = 4; flag = 1; }
        else if (!PORTGbits.RG7) { col = 2; row = 4; flag = 1; }
        else if (!PORTGbits.RG8) { col = 3; row = 4; flag = 1; }
        else if (!PORTGbits.RG9) { col = 4; row = 4; flag = 1; }
        
        LATGbits.LATG6 = 1; // Deactivate row
    }
    
    if (!flag) return 0; // No key detected
    
    else{ // key Detected
        
        // Wait for key release (debounce)
        while (!PORTCbits.RC3 || !PORTGbits.RG7 || !PORTGbits.RG8 || !PORTGbits.RG9) {
            delay_ms(10); // Check every 10ms
        }
        
        delay_ms(50); // Additional debounce time after release
        
        return (row << 4)|col;
    }
}

void main(void)
{
    unsigned int adc_val, display_val;
    int correct_counter = 0;

    TRISBbits.TRISB14 = 0;
    ANSELBbits.ANSB14 = 0;
    TRISBbits.TRISB15 = 0; // RS
    TRISDbits.TRISD5  = 0; // RW
    TRISDbits.TRISD4  = 0; // EN
    TRISE = 0x00;
    ANSELE = 0x00;
    ANSELBbits.ANSB15 = 0;

    TRISBbits.TRISB2 = 1;
    ANSELBbits.ANSB2 = 1;
    TRISA &= 0xFF00;
    LATA = 0;

    TRISFbits.TRISF3 = 1; // SW0

    init_lcd();
    ADC_Init();
    setup_pins();
    init_RGB_LED();
    init_ssd();
    init_timer5();
    
    // Enable interrupts
    INTCONbits.MVEC = 1;
    asm("ei");
   
    lcd_cmd(LCD_CLEAR);
    lcd_cmd(LCD_LINE1);
    lcd_write_str("Answer the hint");
    lcd_cmd(LCD_LINE2);
    lcd_write_str("101 in binary is");

    while (1)
    {
        adc_val = ADC_AnalogRead(2);
        display_val = adc_val / 4;
        PORTA = display_val;

        if (display_val >= 100 && display_val <= 102)
            correct_counter++;
        else
            correct_counter = 0;

        if (correct_counter >= 20)
        {
            lcd_cmd(LCD_CLEAR);
            lcd_cmd(LCD_LINE1);
            lcd_write_str("Correct!");
            break;
        }

        delay_ms(100);
    }

    delay_ms(3000);
    int exitGame = 1;
    int character = 0;
    int coins = 10;
    int speed;
    PORTA = 0;
    while(exitGame){
        int gameOver = 1;
        int key = 0;
        
        // Initialize display for menu
        display_coins(coins);
        
        while(key != 0x34 && key != 0x44 && key != 0x24 ){
            lcd_cmd(LCD_CLEAR);
            lcd_cmd(LCD_LINE1);
            lcd_write_str("MENU:   Play-1");
            lcd_cmd(LCD_LINE2);
            lcd_write_str("Exit-2  Store-3 ");
            
