einavh550/pic32-embedded-mini-game/pic32_arcade_game.c
            // Keep display updated during menu
            display_coins(coins);
            delay_ms(50);  // Short delay to reduce LCD refresh rate
            
            key = scan_keypad();
        }
        if (key == 0x44){
            key = 0;
            lcd_cmd(LCD_CLEAR);
            lcd_cmd(LCD_LINE1);
            lcd_write_str("Easy press - 1");
            lcd_cmd(LCD_LINE2);
            lcd_write_str("Hard press - 2");
            delay_ms(1000);
            while (1)
            {
                key = scan_keypad();
                if (key == 0x44)
                {
                    lcd_cmd(LCD_CLEAR);
                    lcd_cmd(LCD_LINE1);
                    lcd_write_str("Easy mode selected");
                    speed = 0;
                    break;
                }
                else if (key == 0x34)
                {
                    lcd_cmd(LCD_CLEAR);
                    lcd_cmd(LCD_LINE1);
                    lcd_write_str("Hard mode selected");
                    speed = 1;
                    break;
                }
                delay_ms(100);
            }

            delay_ms(2000);
            int Score = 0;
            int prevSW0 = 0;
            int currentSW0 = 0;
            unsigned char player_row = 0xC0;
            unsigned char player_col = 0;
            unsigned char coin_col = 15;
            unsigned char coin_row = 0x80;
            unsigned char bomb_col = 10;
            unsigned char bomb_row = 0xC0;
            int toggle = 0;
            int bomb_toggle = 1;
            int ch;

            // Initialize coin display
            display_coins(coins);

            if(character == 0){ load_custom_char_hands_down(); ch = 0; }
            else if(character == 1){ load_custom_char_hands_up(); ch = 1; }
            else if(character == 2){ load_custom_char_dog(); ch = 2; }

            load_custom_char_coin();  
            load_custom_char_bomb();  

            lcd_cmd(player_row + player_col); lcd_data(ch);
            lcd_cmd(coin_row + coin_col);     lcd_data(3);
            lcd_cmd(bomb_row + bomb_col);     lcd_data(4);

            while (gameOver)
            {
                    currentSW0 = PORTFbits.RF3;

                    if (currentSW0 && !prevSW0) {
                        player_row = 0x80;
                    } else if (!currentSW0 && prevSW0) {
                        player_row = 0xC0;
                    }
                    prevSW0 = currentSW0;

                    lcd_cmd(coin_row + coin_col); lcd_data(' ');
                    lcd_cmd(bomb_row + bomb_col); lcd_data(' ');
                    lcd_cmd(player_row == 0x80 ? 0xC0 : 0x80); lcd_cmd(player_col); lcd_data(' ');

                    if (coin_col > 0) {
                        coin_col--;
                    } else {
                        coin_col = 15;
                        if (toggle == 0) { coin_row = 0x80; toggle = 1; }
                        else { coin_row = 0xC0; toggle = 0; }
                    }

                    if (bomb_col > 0) {
                        bomb_col--;
                    } else {
                        bomb_col = 15;
                        if (bomb_toggle == 0) { bomb_row = 0xC0; bomb_toggle = 1; }
                        else { bomb_row = 0x80; bomb_toggle = 0; }
                    }

                    
                    lcd_cmd(player_row + player_col); lcd_data(ch);
                    lcd_cmd(coin_row + coin_col);     lcd_data(3);
                    lcd_cmd(bomb_row + bomb_col);     lcd_data(4);

                    
                    if (coin_col == player_col && coin_row == player_row) {
                        coins++;
                        display_coins(coins);  // Update seven-segment display
                        buzz_soft_beep();
                        trigger_green_blink();  // Trigger green blink for coin collection
                    }

                    
                    if (bomb_col == player_col && bomb_row == player_row) {
                        buzz_soft_beep();
                        trigger_red_blink();    // Trigger red triple blink for bomb hit
                        lcd_cmd(LCD_CLEAR);
                        lcd_write_str("BOOM! Game Over");
                        delay_ms(2000);
                        gameOver = 0;
                        break;
                    }

                    if(speed == 1){
                        delay_ms(180);
                    }
                    else{
                        delay_ms(400);
                    }
            }

        }
        else if (key == 0x34){
            exitGame = 0;
            lcd_cmd(LCD_CLEAR);
            lcd_cmd(LCD_LINE1);
            lcd_write_str("Good_Bye ");
            delay_ms(2000);
        }
        else if(key == 0x24){
            lcd_cmd(LCD_CLEAR);
            
            key = 0;

            load_custom_char_hands_down(); // 0 
            load_custom_char_hands_up();   // 1
            load_custom_char_dog();        // 2

            lcd_cmd(LCD_LINE1 + 0);
            lcd_write_str("0C");

            lcd_cmd(LCD_LINE1 + 6);
            lcd_write_str("5C");

            lcd_cmd(LCD_LINE1 + 12);
            lcd_write_str("4C");

            lcd_cmd(0xC0 + 0);
            lcd_data(0);

            lcd_cmd(0xC0 + 6);
            lcd_data(1);

            lcd_cmd(0xC0 + 12);
            lcd_data(2);

            while(1)
            {
                // Keep display stable during store browsing
                display_coins(coins);
                delay_ms(10);
                
                key = scan_keypad();
                if(key == 0x42 && coins >= 2){
                    character = 0;
                    display_coins(coins);  // Update display immediately
                    lcd_cmd(LCD_CLEAR);
                    lcd_write_str("chosen Char 1!");
                    break;
                } else if(key == 0x43 && coins >= 5){
                    coins -= 5;
                    display_coins(coins);  // Update display immediately after purchase
                    character = 1;
                    lcd_cmd(LCD_CLEAR);
                    lcd_write_str("Bought Char 2!");
                    break;
                } else if(key == 0x44 && coins >= 4){
                    coins -= 4;
                    display_coins(coins);  // Update display immediately after purchase
                    character = 2;
                    lcd_cmd(LCD_CLEAR);
                    lcd_write_str("Bought Char 3!");
                    break;
                } else if(key == 0x44 || key == 0x43 || key == 0x42){
                    lcd_cmd(LCD_CLEAR);
                    lcd_write_str("Not enough coins");
                    delay_ms(1500);
                    break;
                }
            }
            delay_ms(2000);
        }
    }
}

void load_custom_char_bomb(void)
{
    unsigned char bomb[8] = {
        0x04,
        0x0A,
        0x15,
        0x0E,
        0x0E,
        0x1F,
        0x04,
        0x0A
    };

    lcd_cmd(0x50 + 16);
    for (int i = 0; i < 8; i++) {
        lcd_data(bomb[i]);
    }
}

