einavh550/pic32-embedded-mini-game/pic32_arcade_game.c
void load_custom_char_dog(void)
{
    unsigned char dog[8] = {
        0x00,
        0x0A,
        0x1F,
        0x15,
        0x1F,
        0x04,
        0x0A,
        0x11
    };

    lcd_cmd(0x50);
    for (int i = 0; i < 8; i++) {
        lcd_data(dog[i]);
    }
}

void load_custom_char_coin(void) {
    unsigned char coin[8] = {
        0b00000,
        0b00110,
        0b01111,
        0b01111,
        0b01111,
        0b01111,
        0b00110,
        0b00000
    };
    
    lcd_cmd(0x50 + 8);
    for (int i = 0; i < 8; i++) {
        lcd_data(coin[i]);
    }
}

void load_custom_char_hands_down(void)
{
    unsigned char man[8] = {
        0x0E,
        0x0E,
        0x04,
        0x04,
        0x0E,
        0x15,
        0x04,
        0x0A
    };

    lcd_cmd(0x40); 
    for (int i = 0; i < 8; i++) {
        lcd_data(man[i]);
    }
}

void load_custom_char_hands_up(void)
{
    unsigned char man[8] = {
        0x0E,   
        0x04,    
        0x15,   
        0x0E,   
        0x04, 
        0x04,  
        0x0A,    
        0x11      
    };

    lcd_cmd(0x40 + 8);
    for (int i = 0; i < 8; i++) {
        lcd_data(man[i]);
    }
}

void buzz_soft_beep(void)
{
    for (int i = 0; i < 100; i++) {
        PORTBbits.RB14 = 1;
        delay_us(300); 
        PORTBbits.RB14 = 0;
        delay_us(300);
    }
}

void delay_us(unsigned int us)
{
    for (int i = 0; i < us; i++) {
        for (volatile int j = 0; j < 2; j++); 
        
    }
}

void init_ssd(void)
{
    // Configure anode pins as outputs
    TRISBbits.TRISB12 = 0;  // AN0
    TRISBbits.TRISB13 = 0;  // AN1
    TRISAbits.TRISA9 = 0;   // AN2
    TRISAbits.TRISA10 = 0;  // AN3
    
    // Configure cathode pins as outputs
    TRISGbits.TRISG12 = 0;  // CA
    TRISAbits.TRISA14 = 0;  // CB
    TRISDbits.TRISD6 = 0;   // CC
    TRISGbits.TRISG13 = 0;  // CD
    TRISGbits.TRISG15 = 0;  // CE
    TRISDbits.TRISD7 = 0;   // CF
    TRISDbits.TRISD13 = 0;  // CG
    
    // Disable analog functionality for AN0 and AN1
    ANSELBbits.ANSB12 = 0;
    ANSELBbits.ANSB13 = 0;
    
    // Initialize all digits off (anodes high)
    LATBbits.LATB12 = 1;   // AN0
    LATBbits.LATB13 = 1;   // AN1
    LATAbits.LATA9 = 1;    // AN2
    LATAbits.LATA10 = 1;   // AN3
    
    // Initialize all segments off (cathodes high for common anode)
    LATGbits.LATG12 = 1;   // CA
    LATAbits.LATA14 = 1;   // CB
    LATDbits.LATD6 = 1;    // CC
    LATGbits.LATG13 = 1;   // CD
    LATGbits.LATG15 = 1;   // CE
    LATDbits.LATD7 = 1;    // CF
    LATDbits.LATD13 = 1;   // CG
}

void display_coins(int coin_count)
{
    coin_display_value = coin_count;
}


void init_lcd(void)
{
    lcd_cmd(0x38); 
    lcd_cmd(0x0C); 
    lcd_cmd(0x06); 
    lcd_cmd(0x01); 
    delay_ms(250);
}

void lcd_write_str(const char *str)
{
    while (*str)
        lcd_data(*str++);
}

void lcd_cmd(unsigned char cmd)
{
    PORTBbits.RB15 = 0; // RS = 0
    PORTDbits.RD5 = 0;  // RW = 0
    PORTE = cmd;
    PORTDbits.RD4 = 1;
    PORTDbits.RD4 = 0;
    busy();
}

void lcd_data(unsigned char data)
{
    PORTBbits.RB15 = 1; // RS = 1
    PORTDbits.RD5 = 0;  // RW = 0
    PORTE = data;
    PORTDbits.RD4 = 1;
    PORTDbits.RD4 = 0;
    busy();
}



void delay_ms(int ms)
{
    int i, j;
    for (i = 0; i < ms; i++)
        for (j = 0; j < 800; j++);
}



void busy(void)
{
    char RD, RS;
    int STATUS_TRISE;
    int portMap;

    RD = PORTDbits.RD5;
    RS = PORTBbits.RB15;
    STATUS_TRISE = TRISE;
    PORTDbits.RD5 = 1; // RW = 1
    PORTBbits.RB15 = 0; // RS = 0
    portMap = TRISE;
    portMap |= 0x80; // RE7
    TRISE = portMap;

    do {
        PORTDbits.RD4 = 1;
        _asm_ volatile("nop");
        PORTDbits.RD4 = 0;
    } while (PORTEbits.RE7);

    PORTDbits.RD5 = RD;
    PORTBbits.RB15 = RS;
    TRISE = STATUS_TRISE;
}

// === ADC ===
void ADC_Init()
{
    AD1CON1 = 0;
    AD1CON1bits.SSRC = 7;
    AD1CON1bits.FORM = 0;
    AD1CSSL = 0;
    AD1CON3 = 0x0002;
    AD1CON2 = 0;
    AD1CON2bits.VCFG = 0;
    AD1CON1bits.ON = 1;
}

unsigned int ADC_AnalogRead(unsigned char analogPIN)
{
    int adc_val = 0;
    AD1CHS = analogPIN << 16;
    AD1CON1bits.SAMP = 1;
    while (AD1CON1bits.SAMP);
    while (!AD1CON1bits.DONE);
    adc_val = ADC1BUF0;
    return adc_val;
}
